public/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Harmony Project</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-07-01 Thu"/>
<meta name="author" content="Brian L. Troutwine"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">

<h1 class="title">Harmony Project</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction </a></li>
<li><a href="#sec-2">2 Dependencies </a>
<ul>
<li><a href="#sec-2.1">2.1 Running a Client </a></li>
<li><a href="#sec-2.2">2.2 Running the Server </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Source </a></li>
<li><a href="#sec-4">4 Download </a></li>
<li><a href="#sec-5">5 Network Protocol </a>
<ul>
<li><a href="#sec-5.1">5.1 Commands </a></li>
<li><a href="#sec-5.2">5.2 addStar </a></li>
<li><a href="#sec-5.3">5.3 delStar </a></li>
<li><a href="#sec-5.4">5.4 addPlanet </a></li>
<li><a href="#sec-5.5">5.5 delPlanet </a></li>
<li><a href="#sec-5.6">5.6 getUni </a></li>
<li><a href="#sec-5.7">5.7 Fault Codes </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction </h2>
<div class="outline-text-2" id="text-1">


<p>
Harmony is a collaborative musical instrument: users connect to an infinite
(Currently finite: sorry folks! -ed.)  Universe, add stars associated with a
key signature and orbit planets in rings around the stars which incites them
to hum. User's connect and work together to make beautiful music.
</p>
<p>
That's the plan, anyway.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dependencies </h2>
<div class="outline-text-2" id="text-2">


<p>
What you'll need to run Harmony depends on your desire.
</p>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Running a Client </h3>
<div class="outline-text-3" id="text-2.1">


<p>
You'll need:
</p>
<dl>
<dt>Python &gt;= 2.5</dt><dd>
Client support libraries are Python.

</dd>
<dt>Pygame == 1.9</dt><dd>
The client interface is <a href="http://www.pygame.org/">Pygame</a>.

</dd>
</dl>

<p>If you have to build Pygame you'll need to install SDL development
libraries. The details are on their site.
</p>
</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Running the Server </h3>
<div class="outline-text-3" id="text-2.2">


<p>
You'll need:
</p>
<dl>
<dt>Erlang == R13B04</dt><dd>
Owing to the way Erlang releases work, you will need
exactly <a href="http://www.erlang.org/download/otp_src_R13B04.tar.gz">R13B04</a>. Sorry about that!

</dd>
</dl>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Source </h2>
<div class="outline-text-2" id="text-3">


<p>
The head repository for Harmony is to be found <a href="http://github.com/blt/Harmony">at GitHub</a>. Fork
it!
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Download </h2>
<div class="outline-text-2" id="text-4">


<p>
There are no binaries available at this time. Sorry about that!
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Network Protocol </h2>
<div class="outline-text-2" id="text-5">


<p>
The Harmony network protocol is a relatively simple affair. The
harmony<sub>listener</sub>.erl module located in the server/src directory decodes
incoming TCP messages, issues their corresponding commands, bundles each
commands response, and sends back to the sender.  On the client side, there
exists a python class file (harmonyConn.py, located in the client/src) that
provides the TCP connections, issuing commands to the server, decoding the
server returns, and provides valid results to the python application.
</p>
<p>
An RFC this is not, but below you'll find an overview of the protocol.
</p>

</div>

<div id="outline-container-5.1" class="outline-3">
<h3 id="sec-5.1"><span class="section-number-3">5.1</span> Commands </h3>
<div class="outline-text-3" id="text-5.1">


<p>
All notation is value:bits. All faults have a return value of (0:8,
FaultCode:8), discussed further in the <a href="#sec-5.1">Fault Codes</a> section, below.
</p>
</div>

</div>

<div id="outline-container-5.2" class="outline-3">
<h3 id="sec-5.2"><span class="section-number-3">5.2</span> addStar </h3>
<div class="outline-text-3" id="text-5.2">


<p>
Add a star to the Harmony Universe.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Send</th><th scope="col">Return</th></tr>
</thead>
<tbody>
<tr><td>(Command, X position, Y position, Key)</td><td>(success, StarId)</td></tr>
<tr><td>(1:8, X:16, Y:16, Key:8)</td><td>(1:8, StarId:16)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5.3" class="outline-3">
<h3 id="sec-5.3"><span class="section-number-3">5.3</span> delStar </h3>
<div class="outline-text-3" id="text-5.3">


<p>
Delete a star from the Harmony Universe.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Send</th><th scope="col">Return</th></tr>
</thead>
<tbody>
<tr><td>(Command, StarId)</td><td>(success, StarId)</td></tr>
<tr><td>(2:8, StarId:16)</td><td>(1:8, StarId:16)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5.4" class="outline-3">
<h3 id="sec-5.4"><span class="section-number-3">5.4</span> addPlanet </h3>
<div class="outline-text-3" id="text-5.4">


<p>
Add a planet to the Harmony Universe.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Send</th><th scope="col">Return</th></tr>
</thead>
<tbody>
<tr><td>(Command, StarId, Angle, Speed, Radius, Note)</td><td>(success, PlanetId)</td></tr>
<tr><td>(2:8, StarId:16, Angle:16, Speed:16, Radius:16, Note:8)</td><td>(1:8, PlanetId:16)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5.5" class="outline-3">
<h3 id="sec-5.5"><span class="section-number-3">5.5</span> delPlanet </h3>
<div class="outline-text-3" id="text-5.5">


<p>
Delete a planet from the Harmony Universe.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Send</th><th scope="col">Return</th></tr>
</thead>
<tbody>
<tr><td>(Command, StarId, PlanetId)</td><td>(success, PlanetId)</td></tr>
<tr><td>(2:8, PlanetId:16)</td><td>(1:8, PlanetId:16)</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-5.6" class="outline-3">
<h3 id="sec-5.6"><span class="section-number-3">5.6</span> getUni </h3>
<div class="outline-text-3" id="text-5.6">


<p>
Return the Universe state as a difference of changes from the given time.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Send</th><th scope="col">Return</th></tr>
</thead>
<tbody>
<tr><td>(Command, MegSec, Sec, MicroSec)</td><td>(success, Universe)</td></tr>
<tr><td>(16:8, MegSec:16, Sec:32, MicroSec:32)</td><td>(1:8, Universe:arbitrary)</td></tr>
</tbody>
</table>


<p>
The length of the Universe return is dependant on the size of the
Universe. All time-stamps have the format as given above in the command Send
column. The Universe itself has the following format:
</p>
<ul>
<li>
(time-stamp:80, TotalStars:16, Systems)

</li>
</ul>

<p>where Systems has the format:
</p>
<ul>
<li>
(StarId:16, Xpos:16, Ypos:16, Key:8, ModifiedTime:80, TotalPlanets:16,
Planets)

</li>
</ul>

<p>where Planets has the format:
</p>
<ul>
<li>
(PlanetId:16, Angle:16, Speed:16, Radius:16, Note:8, CreatedTime:80).

</li>
</ul>
</div>

</div>

<div id="outline-container-5.7" class="outline-3">
<h3 id="sec-5.7"><span class="section-number-3">5.7</span> Fault Codes </h3>
<div class="outline-text-3" id="text-5.7">


<p>
Faults are returned to the client in two 8-bit terms, the first being the
error condition and the second the error code. The error codes are:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="right" /><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Value</th><th scope="col">Name</th><th scope="col">Description</th></tr>
</thead>
<tbody>
<tr><td>0</td><td>CommandFault</td><td>No matching command.</td></tr>
<tr><td>1</td><td>AddStarFault</td><td>No matching star based on ID.</td></tr>
<tr><td>2</td><td>DelStarFault</td><td>No matching star based on ID.</td></tr>
<tr><td>3</td><td>AddPlanetFault</td><td>No matching star or planet based on ID.</td></tr>
<tr><td>4</td><td>DelPlanetFault</td><td>No matching star or planet based on ID.</td></tr>
<tr><td>5</td><td>GenUNIFault</td><td>Incorrect arguments.</td></tr>
</tbody>
</table>




<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-15917184-2']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type =
    'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ?
    'https://ssl' : 'http://www') +
    '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0];
    s.parentNode.insertBefore(ga, s);
  })();

</script>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Brian L. Troutwine
<a href="mailto:brian@troutwine.us">&lt;brian@troutwine.us&gt;</a>
</p>
<p class="date"> Date: 2010-07-01 Thu</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
